app/controllers/articles_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "New article"], ["description", "This is a new article\r\n"], ["created_at", "2019-10-30 16:45:44.447431"], ["updated_at", "2019-10-30 16:45:44.447431"], ["user_id", 5]]
---
  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]
---
  def destroy
    set_article
    @article.destroy