app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "mashrur8@example.com"], ["updated_at", "2019-10-30 19:33:02.669243"], ["id", 8]]
---
  def update
    if @user.update(user_params)

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 5]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]
---
  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)