app/views/layouts/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
          <%= link_to "All Categories", categories_path, class: "dropdown-item" %>
          <% Category.all.each do |category| %>